[Survived] BlockStatement
Projetos React/personcrud/src/App.tsx:6:16
 import Router from './routes'
 import Header from "./components/Header/Index"
 
-function App() {
-  return (
-      <BrowserRouter>
-          <Header/>
-          <Router />
-      </BrowserRouter>
-  );
-}
+function App() {}
 
 export default App;
