[Survived] ObjectLiteral
pages/Person/Form/Address.tsx:10:63
 const AddressForm = () => {
     const navigate = useNavigate()
     const {id } = useParams()
-    const [address, setAddress] = useState<AddressFormInterf>({
-        zipcode: '',//cep
-        street: '', // longradouro
-        number: 0, //numero
-        suite: '', //complemento
-        bairro: '', //bairro
-        city: '', // cidade
-        estado: '' //estado
-    })
+    const [address, setAddress] = useState<AddressFormInterf>({})
 
     useEffect(() => {

[Survived] StringLiteral
pages/Person/Form/Address.tsx:14:16
         zipcode: '',//cep
         street: '', // longradouro
         number: 0, //numero
-        suite: '', //complemento
+        suite: "Stryker was here!", //complemento
         bairro: '', //bairro
         city: '', // cidade

[Survived] StringLiteral
pages/Person/Form/Address.tsx:17:17
         suite: '', //complemento
         bairro: '', //bairro
         city: '', // cidade
-        estado: '' //estado
+        estado: "Stryker was here!" //estado
     })
 

[Survived] BlockStatement
pages/Person/Form/Address.tsx:20:21
         estado: '' //estado
     })
 
-    useEffect(() => {
-        if (id !== undefined){
-            findAddress(id)
-        }
-    }, [id])
+    useEffect(() => {}, [id])
 
     // Funcao para atualizar os valores do endereco,d e acordo com cada campo

[Survived] ConditionalExpression
pages/Person/Form/Address.tsx:21:13
     })
 
     useEffect(() => {
-        if (id !== undefined){
+        if (true){
             findAddress(id)
         }

[Survived] EqualityOperator
pages/Person/Form/Address.tsx:21:13
     })
 
     useEffect(() => {
-        if (id !== undefined){
+        if (id === undefined){
             findAddress(id)
         }

[Survived] BlockStatement
pages/Person/Form/Address.tsx:27:62
     }, [id])
 
     // Funcao para atualizar os valores do endereco,d e acordo com cada campo
-    function updateAddress (e: ChangeEvent<HTMLInputElement>){
-        setAddress({
-            ...address,
-            [e.target.name]: e.target.value
-        })
-    }
+    function updateAddress (e: ChangeEvent<HTMLInputElement>){}
 
     async function findAddress (id: string){

[Survived] BlockStatement
pages/Person/Form/Address.tsx:34:44
         })
     }
 
-    async function findAddress (id: string){
-        const response = await axios.get(`https://jsonplaceholder.typicode.com/users/${id}`)
-        console.log(response)
-        setAddress({
-            zipcode: response.data.address.zipcode,
-            street: response.data.address.street,
-            number: response.data.address.number,
-            suite: response.data.address.suite,
-            bairro: response.data.address.city,
-            city: response.data.address.city,
-            estado: response.data.address.estado
-        })
-    }
+    async function findAddress (id: string){}
 
 

[Survived] BlockStatement
pages/Person/Form/Address.tsx:50:62
 
 
     // Funcao para enviar os dados para o BD (api do Elizeu)
-    async  function onSubmit (e:ChangeEvent<HTMLFormElement>){
-        e.preventDefault()
-        if (id !== undefined){
-            const response = await axios.put(`https://jsonplaceholder.typicode.com/users/${id}`, address)
-            console.log(response)
-        }else {
-            const response = await axios.post('https://jsonplaceholder.typicode.com/users/', address)
-            console.log(id)
-        }
-       goHome()
-    }
+    async  function onSubmit (e:ChangeEvent<HTMLFormElement>){}
 
 

[Survived] BlockStatement
pages/Person/Form/Address.tsx:52:30
     // Funcao para enviar os dados para o BD (api do Elizeu)
     async  function onSubmit (e:ChangeEvent<HTMLFormElement>){
         e.preventDefault()
-        if (id !== undefined){
-            const response = await axios.put(`https://jsonplaceholder.typicode.com/users/${id}`, address)
-            console.log(response)
-        }else {
+        if (id !== undefined){}else {
             const response = await axios.post('https://jsonplaceholder.typicode.com/users/', address)
             console.log(id)

[Survived] ConditionalExpression
pages/Person/Form/Address.tsx:52:13
     // Funcao para enviar os dados para o BD (api do Elizeu)
     async  function onSubmit (e:ChangeEvent<HTMLFormElement>){
         e.preventDefault()
-        if (id !== undefined){
+        if (true){
             const response = await axios.put(`https://jsonplaceholder.typicode.com/users/${id}`, address)
             console.log(response)

[Survived] StringLiteral
pages/Person/Form/Address.tsx:53:46
     async  function onSubmit (e:ChangeEvent<HTMLFormElement>){
         e.preventDefault()
         if (id !== undefined){
-            const response = await axios.put(`https://jsonplaceholder.typicode.com/users/${id}`, address)
+            const response = await axios.put(``, address)
             console.log(response)
         }else {

[Survived] BlockStatement
pages/Person/Form/Address.tsx:55:15
         if (id !== undefined){
             const response = await axios.put(`https://jsonplaceholder.typicode.com/users/${id}`, address)
             console.log(response)
-        }else {
-            const response = await axios.post('https://jsonplaceholder.typicode.com/users/', address)
-            console.log(id)
-        }
+        }else {}
        goHome()
     }

[Survived] StringLiteral
pages/Person/Form/Address.tsx:56:47
             const response = await axios.put(`https://jsonplaceholder.typicode.com/users/${id}`, address)
             console.log(response)
         }else {
-            const response = await axios.post('https://jsonplaceholder.typicode.com/users/', address)
+            const response = await axios.post("", address)
             console.log(id)
         }

[Survived] BlockStatement
pages/Person/Form/Address.tsx:63:25
     }
 
 
-    function goPerson (){
-        if (id !== undefined){
-            navigate(`/pessoas_cadastro/${id}`)
-        }else {
-            navigate(`/pessoas_cadastro`)
-        }
-
-    }
+    function goPerson (){}
 
     function goHome(){

[Survived] BlockStatement
pages/Person/Form/Address.tsx:64:30
 
 
     function goPerson (){
-        if (id !== undefined){
-            navigate(`/pessoas_cadastro/${id}`)
-        }else {
+        if (id !== undefined){}else {
             navigate(`/pessoas_cadastro`)
         }

[Survived] ConditionalExpression
pages/Person/Form/Address.tsx:64:13
 
 
     function goPerson (){
-        if (id !== undefined){
+        if (false){
             navigate(`/pessoas_cadastro/${id}`)
         }else {

[Survived] BlockStatement
pages/Person/Form/Address.tsx:66:15
     function goPerson (){
         if (id !== undefined){
             navigate(`/pessoas_cadastro/${id}`)
-        }else {
-            navigate(`/pessoas_cadastro`)
-        }
+        }else {}
 
     }

[Survived] BlockStatement
pages/Person/Form/Address.tsx:72:22
 
     }
 
-    function goHome(){
-        navigate('/pessoas')
-    }
+    function goHome(){}
 
 

[Survived] StringLiteral
pages/Person/Form/Address.tsx:73:18
     }
 
     function goHome(){
-        navigate('/pessoas')
+        navigate("")
     }
 

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:86:35
                         type="text"
                         name="zipcode"
                         value={address.zipcode}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                         placeholder="Digite o CEP"
                     />

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:97:35
                         type="text"
                         name="street"
                         value={address.street}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                         placeholder="Longradouro..."
                     />

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:110:35
                         type="number"
                         name="number"
                         value={address.number}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                         placeholder="Numero"
                     />

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:121:35
                         type="text"
                         name="suite"
                         value={address.suite}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                         placeholder="Complemento"
                     />

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:135:35
                         type="text"
                         name="bairro"
                         value={address.bairro}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                     />
                 </Form.Group>

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:145:35
                         type="text"
                         name="city"
                         value={address.city}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                     />
                 </Form.Group>

[Survived] ArrowFunction
pages/Person/Form/Address.tsx:162:35
                         type="text"
                         name="estado"
                         value={address.estado}
-                        onChange={(e:ChangeEvent<HTMLInputElement>) => updateAddress(e)}
+                        onChange={() => undefined}
                     />
 

[Survived] StringLiteral
pages/Person/Form/Address.tsx:167:74
 
                 </Form.Group>
             </Row>
-            <Button variant="success" onClick={goPerson}>Voltar</Button>{'  '}
+            <Button variant="success" onClick={goPerson}>Voltar</Button>{""}
             <Button variant="primary" type="submit">
                 Salvar
