[Survived] BlockStatement
pages/Person/Form/IndexForm.tsx:16:21
         email: ''
     })
 
-    useEffect(() => {
-        if (id !== undefined){
-            findPerson(id)
-        }
-    }, [id])
+    useEffect(() => {}, [id])
 
     function updatedPerson (e: ChangeEvent<HTMLInputElement>){

[Survived] ConditionalExpression
pages/Person/Form/IndexForm.tsx:17:13
     })
 
     useEffect(() => {
-        if (id !== undefined){
+        if (false){
             findPerson(id)
         }

[Survived] BlockStatement
pages/Person/Form/IndexForm.tsx:22:62
         }
     }, [id])
 
-    function updatedPerson (e: ChangeEvent<HTMLInputElement>){
-        setNewPerson({
-            ...newPerson,
-            [e.target.name]:e.target.value
-        })
-    }
+    function updatedPerson (e: ChangeEvent<HTMLInputElement>){}
 
     async  function onSubmit (e:ChangeEvent<HTMLFormElement>){

[Survived] BlockStatement
pages/Person/Form/IndexForm.tsx:29:62
         })
     }
 
-    async  function onSubmit (e:ChangeEvent<HTMLFormElement>){
-        e.preventDefault()
-        if (id !== undefined){
-            const response = await api.put(`/users/${id}`, newPerson)
-            navigate(`/address/${id}`)
-        }else {
-            const response = await api.post('/users', newPerson)
-            navigate('/address')
-        }
-    }
+    async  function onSubmit (e:ChangeEvent<HTMLFormElement>){}
 
     async function findPerson(id: string){

[Survived] EqualityOperator
pages/Person/Form/IndexForm.tsx:31:13
 
     async  function onSubmit (e:ChangeEvent<HTMLFormElement>){
         e.preventDefault()
-        if (id !== undefined){
+        if (id === undefined){
             const response = await api.put(`/users/${id}`, newPerson)
             navigate(`/address/${id}`)

[Survived] BlockStatement
pages/Person/Form/IndexForm.tsx:34:15
         if (id !== undefined){
             const response = await api.put(`/users/${id}`, newPerson)
             navigate(`/address/${id}`)
-        }else {
-            const response = await api.post('/users', newPerson)
-            navigate('/address')
-        }
+        }else {}
     }
 

[Survived] StringLiteral
pages/Person/Form/IndexForm.tsx:35:45
             const response = await api.put(`/users/${id}`, newPerson)
             navigate(`/address/${id}`)
         }else {
-            const response = await api.post('/users', newPerson)
+            const response = await api.post("", newPerson)
             navigate('/address')
         }

[Survived] BlockStatement
pages/Person/Form/IndexForm.tsx:40:42
         }
     }
 
-    async function findPerson(id: string){
-        const response = await api.get(`/users/${id}`)
-        setNewPerson({
-            name: response.data.name,
-            username: response.data.username,
-            email: response.data.email
-        })
-    }
+    async function findPerson(id: string){}
 
     function back (){

[Survived] ObjectLiteral
pages/Person/Form/IndexForm.tsx:42:22
 
     async function findPerson(id: string){
         const response = await api.get(`/users/${id}`)
-        setNewPerson({
-            name: response.data.name,
-            username: response.data.username,
-            email: response.data.email
-        })
+        setNewPerson({})
     }
 

[Survived] BlockStatement
pages/Person/Form/IndexForm.tsx:49:21
         })
     }
 
-    function back (){
-        navigate('/pessoas')
-    }
+    function back (){}
 
     return (

[Survived] ArrowFunction
pages/Person/Form/IndexForm.tsx:69:39
                             type="text"
                             name="name"
                             value={newPerson.name}
-                            onChange={(e:ChangeEvent<HTMLInputElement>) => updatedPerson(e)}
+                            onChange={() => undefined}
                             placeholder="Nome completo"
                         />

[Survived] ArrowFunction
pages/Person/Form/IndexForm.tsx:81:39
                             type="text"
                             name="username"
                             value={newPerson.username}
-                            onChange={(e:ChangeEvent<HTMLInputElement>) => updatedPerson(e)}
+                            onChange={() => undefined}
                             placeholder="Idade"
                         />

[Survived] ArrowFunction
pages/Person/Form/IndexForm.tsx:93:39
                             type="text"
                             name="email"
                             value={newPerson.email}
-                            onChange={(e:ChangeEvent<HTMLInputElement>) => updatedPerson(e)}
+                            onChange={() => undefined}
                             placeholder="CPF"
                         />

[Survived] StringLiteral
pages/Person/Form/IndexForm.tsx:98:79
                         />
                     </Form.Group>
                     <br/>
-                    <Button variant="success" onClick={back}>Voltar</Button> {'   '}
+                    <Button variant="success" onClick={back}>Voltar</Button> {""}
                     <Button variant="primary" type="submit">
                         Próximo
