[Killed] BlockStatement
src/pages/Home/Home.tsx:6:20
 import {useNavigate} from "react-router-dom";
 import ImgPerson from '../../pictures/person.png'
 
-const Home = () => {
-
-    const navigate = useNavigate()
-
-    function goPessoa (){
-        navigate('/pessoas')
-    }
-
-    return (
-        <div className="container">
-            <br/>
-            <div className="home-header"/>
-            <br/>
-            <Card style={{ width: '20rem', margin: "auto"}}>
-                <Card.Img variant="top" src={ImgPerson} />
-                <Card.Body>
-                    <Card.Title>CRUD de Pessoas</Card.Title>
-                    <Card.Text>
-                        Simples projeto para estudo sobre desenvolvimento WEB.
-                    </Card.Text>
-                    <Button variant="primary" onClick={goPessoa}>Iniciar</Button>
-                </Card.Body>
-            </Card>
-        </div>
-    )}
+const Home = () => {}
 export default Home;
killedBy: <Home/> Validar cabeçalho
statusReason: Error: Home(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] BlockStatement
src/pages/Home/Home.tsx:10:25
 
     const navigate = useNavigate()
 
-    function goPessoa (){
-        navigate('/pessoas')
-    }
+    function goPessoa (){}
 
     return (
