[Killed] BlockStatement
src/components/Header/Hearder.tsx:5:22
 import {Container, Nav, Navbar} from 'react-bootstrap';
 import {Link} from 'react-router-dom'
 
-const Header = () => {
-    return(
-        <Navbar bg="#323232" expand="lg">
-            <Container>
-                <Navbar.Brand href="/">CrudPerson CRUD</Navbar.Brand>
-                <Navbar.Toggle aria-controls="basic-navbar-nav" />
-                {/*<Navbar.Collapse id="basic-navbar-nav">
-                    <Nav className="me-auto">
-                        <Nav.Item as={Link} to="/" className="nav-link">Inicio</Nav.Item>
-                        <Nav.Item as={Link} to="/pessoas" className="nav-link" >Pessoas</Nav.Item>
-                        <Nav.Item as={Link} to="/address" className="nav-link" >Endereço</Nav.Item>
-                    </Nav>
-                </Navbar.Collapse> */}
-            </Container>
-        </Navbar>
-    );
-}
+const Header = () => {}
 
 export default Header
killedBy: <Header/> Validar se o Titulo será apresentado
statusReason: Error: Header(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
