[Survived] ArrayDeclaration
src/pages/Person/Person.tsx:10:58
 
 const CrudPerson = () => {
     //Declarando variável para pegar os dados da API
-    const [person, setPerson] = useState<PersonInterf[]>([])
+    const [person, setPerson] = useState<PersonInterf[]>(["Stryker was here"])
     const navigate = useNavigate()
 

[Survived] BlockStatement
src/pages/Person/Person.tsx:14:21
     const navigate = useNavigate()
 
     //Usado para executar a funcao, assim que a página for iniciada.
-    useEffect(() => {
-        loadPerson();
-    }, [])
+    useEffect(() => {}, [])
 
     async function loadPerson (){

[Survived] ArrayDeclaration
src/pages/Person/Person.tsx:16:8
     //Usado para executar a funcao, assim que a página for iniciada.
     useEffect(() => {
         loadPerson();
-    }, [])
+    }, ["Stryker was here"])
 
     async function loadPerson (){

[Survived] BlockStatement
src/pages/Person/Person.tsx:18:33
         loadPerson();
     }, [])
 
-    async function loadPerson (){
-        //Mudar o servico depois
-        const response = await api.get('/users')
-        console.log(response)
-        setPerson(response.data)
-    }
+    async function loadPerson (){}
 
     function newPessoa () {

[Survived] StringLiteral
src/pages/Person/Person.tsx:20:40
 
     async function loadPerson (){
         //Mudar o servico depois
-        const response = await api.get('/users')
+        const response = await api.get("")
         console.log(response)
         setPerson(response.data)

[Survived] BlockStatement
src/pages/Person/Person.tsx:25:27
         setPerson(response.data)
     }
 
-    function newPessoa () {
-        navigate('/pessoas_cadastro');
-    }
+    function newPessoa () {}
 
     function editPessoa (id: number) {

[Survived] BlockStatement
src/pages/Person/Person.tsx:29:38
         navigate('/pessoas_cadastro');
     }
 
-    function editPessoa (id: number) {
-        navigate(`/pessoas_cadastro/${id}`);
-    }
+    function editPessoa (id: number) {}
 
     async function deletePessoa(id: number){

[Survived] StringLiteral
src/pages/Person/Person.tsx:30:18
     }
 
     function editPessoa (id: number) {
-        navigate(`/pessoas_cadastro/${id}`);
+        navigate(``);
     }
 

[Survived] BlockStatement
src/pages/Person/Person.tsx:33:44
         navigate(`/pessoas_cadastro/${id}`);
     }
 
-    async function deletePessoa(id: number){
-        await api.delete(`/users/${id}`)
-        loadPerson()
-    }
+    async function deletePessoa(id: number){}
 
     function goInicio(){

[Survived] StringLiteral
src/pages/Person/Person.tsx:34:26
     }
 
     async function deletePessoa(id: number){
-        await api.delete(`/users/${id}`)
+        await api.delete(``)
         loadPerson()
     }

[Survived] BlockStatement
src/pages/Person/Person.tsx:38:24
         loadPerson()
     }
 
-    function goInicio(){
-        navigate('/')
-    }
+    function goInicio(){}
 
     function searchTable(value: string){

[Survived] BlockStatement
src/pages/Person/Person.tsx:42:40
         navigate('/')
     }
 
-    function searchTable(value: string){
-        const filteredData = [];
-        for (let i = 0; i < person.length; ++i){
-            const newValue = value.toLowerCase()
-            const user = person[i].name.toLowerCase()
-            if(user.includes(newValue)){
-                filteredData.push(person[i])
-            }
-        }
-        return filteredData
-    }
+    function searchTable(value: string){}
 
     function handleInput(e: any){

[Survived] ArrayDeclaration
src/pages/Person/Person.tsx:43:30
     }
 
     function searchTable(value: string){
-        const filteredData = [];
+        const filteredData = ["Stryker was here"];
         for (let i = 0; i < person.length; ++i){
             const newValue = value.toLowerCase()

[Survived] BlockStatement
src/pages/Person/Person.tsx:44:48
 
     function searchTable(value: string){
         const filteredData = [];
-        for (let i = 0; i < person.length; ++i){
-            const newValue = value.toLowerCase()
-            const user = person[i].name.toLowerCase()
-            if(user.includes(newValue)){
-                filteredData.push(person[i])
-            }
-        }
+        for (let i = 0; i < person.length; ++i){}
         return filteredData
     }

[Survived] EqualityOperator
src/pages/Person/Person.tsx:44:25
 
     function searchTable(value: string){
         const filteredData = [];
-        for (let i = 0; i < person.length; ++i){
+        for (let i = 0; i >= person.length; ++i){
             const newValue = value.toLowerCase()
             const user = person[i].name.toLowerCase()

[Survived] BlockStatement
src/pages/Person/Person.tsx:47:40
         for (let i = 0; i < person.length; ++i){
             const newValue = value.toLowerCase()
             const user = person[i].name.toLowerCase()
-            if(user.includes(newValue)){
-                filteredData.push(person[i])
-            }
+            if(user.includes(newValue)){}
         }
         return filteredData

[Survived] ConditionalExpression
src/pages/Person/Person.tsx:47:16
         for (let i = 0; i < person.length; ++i){
             const newValue = value.toLowerCase()
             const user = person[i].name.toLowerCase()
-            if(user.includes(newValue)){
+            if(false){
                 filteredData.push(person[i])
             }

[Survived] BlockStatement
src/pages/Person/Person.tsx:54:33
         return filteredData
     }
 
-    function handleInput(e: any){
-        const inputValue = e.target.value;
-        setPerson(searchTable(inputValue))
-    }
+    function handleInput(e: any){}
 
     return (

[Survived] ArrowFunction
src/pages/Person/Person.tsx:81:32
                 </thead>
                 <tbody>
                 {
-                    person.map(person => (
-                            <tr key={person.id}>
-                                <td>{person.id}</td>
-                                <td>{person.name}</td>
-                                <td>{person.username}</td>
-                                <td>{person.email}</td>
-                                <td>
-                                    <Button variant="info" size="sm" onClick={() => editPessoa(person.id)}>Editar</Button>{'      '}
-                                    <Button variant="danger" size="sm" onClick={() => deletePessoa(person.id)}>Excluir</Button>
-                                </td>
-                            </tr>
-                        )
+                    person.map(() => undefined
                     )
                 }

[Survived] ArrowFunction
src/pages/Person/Person.tsx:88:79
                                 <td>{person.username}</td>
                                 <td>{person.email}</td>
                                 <td>
-                                    <Button variant="info" size="sm" onClick={() => editPessoa(person.id)}>Editar</Button>{'      '}
+                                    <Button variant="info" size="sm" onClick={() => undefined}>Editar</Button>{'      '}
                                     <Button variant="danger" size="sm" onClick={() => deletePessoa(person.id)}>Excluir</Button>
                                 </td>

[Survived] StringLiteral
src/pages/Person/Person.tsx:88:124
                                 <td>{person.username}</td>
                                 <td>{person.email}</td>
                                 <td>
-                                    <Button variant="info" size="sm" onClick={() => editPessoa(person.id)}>Editar</Button>{'      '}
+                                    <Button variant="info" size="sm" onClick={() => editPessoa(person.id)}>Editar</Button>{""}
                                     <Button variant="danger" size="sm" onClick={() => deletePessoa(person.id)}>Excluir</Button>
                                 </td>

[Survived] ArrowFunction
src/pages/Person/Person.tsx:89:81
                                 <td>{person.email}</td>
                                 <td>
                                     <Button variant="info" size="sm" onClick={() => editPessoa(person.id)}>Editar</Button>{'      '}
-                                    <Button variant="danger" size="sm" onClick={() => deletePessoa(person.id)}>Excluir</Button>
+                                    <Button variant="danger" size="sm" onClick={() => undefined}>Excluir</Button>
                                 </td>
                             </tr>
