[Survived] BlockStatement
Projetos React/personcrud/src/routes.tsx:8:22
 import PersonForm from './pages/CrudPerson/Form/IndexForm'
 import PersonAddress from './pages/CrudPerson/Form/AddressForm'
 
-const Router = () => {
-    return(
-        <Routes>
-            <Route path="/" element={<Home/>}/>
-            <Route path="/pessoas" element={<CrudPerson/>}/>
-            <Route path="/pessoas_cadastro" element={<PersonForm/>}/>
-            <Route path="/pessoas_cadastro/:id" element={<PersonForm/>}/>
-            <Route path="/address" element={<PersonAddress/>}/>
-            <Route path="/address/:id" element={<PersonAddress/>}/>
-        </Routes>
-    );
-}
+const Router = () => {}
 export default Router
 
