[Survived] ObjectLiteral
personcrud/src/services/api.ts:3:26
 import axios from "axios";
 
-const api = axios.create({
-   //baseURL:"http://localhost:3333"
-
-    //Usada só para implementar o front enquanto a Natalí finaliza a API
-    baseURL: "https://jsonplaceholder.typicode.com/"
-})
+const api = axios.create({})
 
 export default api;

[Survived] StringLiteral
personcrud/src/services/api.ts:7:14
    //baseURL:"http://localhost:3333"
 
     //Usada só para implementar o front enquanto a Natalí finaliza a API
-    baseURL: "https://jsonplaceholder.typicode.com/"
+    baseURL: ""
 })
 
